




// 一个int16能表示四位数值,比如9999,从高到
// 低挨个计算每个位置的数值,我们约定在int16中,
// 按千位、百位、十位、个位来描述每个位置
for (d = 0; d <= int16的权值; d++) {
    // 只有在d=0时候putit=0
    bool putit = (d > 0);

    num = dig / 1000;  // 千位值
    dig -= num * 1000;
    putit |= (num > 0);
    if (putit)
        *str++ = num + '0';

    num = dig / 100;  // 百位值
    dig -= num * 100;
    putit |= (num > 0);
    if (putit)
        *str++ = num + '0';
    // 十位、个位一样的逻辑
}
    // 第一次循环时,putit=0,若千位为0
    // putit或运算的结果是0,不写入,只
    // 要遇到第一个非0(不管千/百/十),
    // putit或运算永远为真,
    // 后续再遇到0就要写入(e.g.:"1000")
